In [66]:
import pandas as pd
import numpy as np

In [67]:
df=pd.read_csv(" tips.csv")

In [68]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [69]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [70]:
from sklearn.preprocessing import LabelEncoder

In [71]:
lb=LabelEncoder()

In [72]:
d1=df.copy()

In [73]:
d1["sex"]=lb.fit_transform(d1["sex"])
d1["smoker"]=lb.fit_transform(d1["smoker"])
d1["day"]=lb.fit_transform(d1["day"])
d1["time"]=lb.fit_transform(d1["time"])

In [74]:
d1.head(2)

   total_bill   tip  sex  smoker  day  time  size
0       16.99  1.01    0       0    2     0     2
1       10.34  1.66    1       0    2     0     3

In [75]:
d=df.copy()

In [76]:
x=d.drop(columns=["total_bill"])
x

      tip     sex smoker   day    time  size
0    1.01  Female     No   Sun  Dinner     2
1    1.66    Male     No   Sun  Dinner     3
2    3.50    Male     No   Sun  Dinner     3
3    3.31    Male     No   Sun  Dinner     2
4    3.61  Female     No   Sun  Dinner     4
..    ...     ...    ...   ...     ...   ...
239  5.92    Male     No   Sat  Dinner     3
240  2.00  Female    Yes   Sat  Dinner     2
241  2.00    Male    Yes   Sat  Dinner     2
242  1.75    Male     No   Sat  Dinner     2
243  3.00  Female     No  Thur  Dinner     2

[244 rows x 6 columns]

In [77]:
y=d["total_bill"]
y

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [79]:
x=d1.drop(columns=["smoker"])
y=d1["smoker"]

In [80]:
from sklearn.model_selection import train_test_split

In [81]:
x_train,x_test,y_train,y_test= train_test_split(x,y,test_size=0.2,random_state=42)

In [82]:
np.round(x_test.describe(),2)

       total_bill    tip    sex    day   time   size
count       49.00  49.00  49.00  49.00  49.00  49.00
mean        18.07   2.64   0.61   1.88   0.31   2.55
std          9.30   1.13   0.49   0.90   0.47   1.00
min          3.07   1.00   0.00   0.00   0.00   1.00
25%         10.77   1.83   0.00   1.00   0.00   2.00
50%         16.49   2.34   1.00   2.00   0.00   2.00
75%         20.90   3.23   1.00   3.00   1.00   3.00
max         48.17   5.16   1.00   3.00   1.00   6.00

# Standardized Data

In [83]:
from sklearn.preprocessing import StandardScaler

In [84]:
sc=StandardScaler()

In [85]:
x_train_sc = sc.fit_transform(x_train)

In [86]:
x_train_new=pd.DataFrame(x_train_sc,columns=x_train.columns)

In [87]:
np.round(x_train_new.describe(),2)

       total_bill     tip     sex     day    time    size
count      195.00  195.00  195.00  195.00  195.00  195.00
mean         0.00   -0.00   -0.00    0.00    0.00   -0.00
std          1.00    1.00    1.00    1.00    1.00    1.00
min         -1.65   -1.46   -1.37   -1.84   -0.61   -1.68
25%         -0.75   -0.76   -1.37   -0.76   -0.61   -0.61
50%         -0.26   -0.06    0.73    0.31   -0.61   -0.61
75%          0.53    0.43    0.73    0.31    1.64    0.45
max          3.50    4.85    0.73    1.39    1.64    3.65

# Normalization

In [88]:
from sklearn.preprocessing import MinMaxScaler

In [89]:
x_train_mn=mn.fit_transform(x_train)

NameError: name 'mn' is not defined

In [90]:
x_train_new=pd.DataFrame(x_train_mn,columns=x_train.columns)

NameError: name 'x_train_mn' is not defined

In [91]:
np.round(x_train_new.describe(),2)

       total_bill     tip     sex     day    time    size
count      195.00  195.00  195.00  195.00  195.00  195.00
mean         0.00   -0.00   -0.00    0.00    0.00   -0.00
std          1.00    1.00    1.00    1.00    1.00    1.00
min         -1.65   -1.46   -1.37   -1.84   -0.61   -1.68
25%         -0.75   -0.76   -1.37   -0.76   -0.61   -0.61
50%         -0.26   -0.06    0.73    0.31   -0.61   -0.61
75%          0.53    0.43    0.73    0.31    1.64    0.45
max          3.50    4.85    0.73    1.39    1.64    3.65

# Ordinal Encoder

In [92]:
df1=df.copy()
df1.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [93]:
df1=df1.drop(columns=["total_bill","tip","day","size"])
df1.head(2)

      sex smoker    time
0  Female     No  Dinner
1    Male     No  Dinner

In [94]:
from sklearn.preprocessing import OrdinalEncoder

In [95]:
oe=OrdinalEncoder(categories=[["Female","Male"],
                  ["Yes","No"],
                  ["Dinner","Lunch"]])

In [96]:
a=oe.fit_transform(df1)

In [97]:
df_new=pd.DataFrame(a,columns=df1.columns)

In [98]:
df_new.head(2)

   sex  smoker  time
0  0.0     1.0   0.0
1  1.0     1.0   0.0

# OneHotEncoder

In [99]:
dfe=df.copy()

In [100]:
dfe.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [101]:
from sklearn.preprocessing import OneHotEncoder

In [102]:
oe=OneHotEncoder(drop="first",sparse_output=False)

In [103]:
a=oe.fit_transform(dfe[["sex","smoker","day","time"]])

In [104]:
a

array([[0., 0., 0., 1., 0., 0.],
       [1., 0., 0., 1., 0., 0.],
       [1., 0., 0., 1., 0., 0.],
       ...,
       [1., 1., 1., 0., 0., 0.],
       [1., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0.]], shape=(244, 6))

In [105]:
ab=df.copy()

In [106]:
ab.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [107]:
pd.get_dummies(ab,columns=["sex",'smoker','day','time'],
              drop_first=True)

,total_bill,tip,size,sex_Male,smoker_Yes,day_Sat,day_Sun,day_Thur,time_Lunch
0,16.99,1.01,2,False,False,False,True,False,False
1,10.34,1.66,3,True,False,False,True,False,False
2,21.01,3.50,3,True,False,False,True,False,False
3,23.68,3.31,2,True,False,False,True,False,False
4,24.59,3.61,4,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,3,True,False,True,False,False,False
240,27.18,2.00,2,False,True,True,False,False,False
241,22.67,2.00,2,True,True,True,False,False,False
242,17.82,1.75,2,True,False,True,False,False,False
243,18.78,3.00,2,False,False,False,False,True,False